import cover1 from './assets/1.png'
import cover2 from './assets/2.png'
import cover3 from './assets/3.png'


export const Books = [
    {
        cover: cover1,
        title: 'Python для детей',
        about: 'Эта книга – самоучитель по одному из самых востребованных на сегодняшний день языков программирования – Python.\
        Начиная с самых простых действий, шаг за шагом вы будете писать свои программы и постигать тонкости этого языка.\
        Свои знания вы сможете проверить сразу же.',
        volume: 327,
        level: 'Начинающий',
        author: 'Джейсон Бриггс',
    },
    {
        cover: cover2,
        title: 'Python в примерах & задачах',
        about: 'В книге рассмотрены базовые методы, подходы и конструкции, важные для понимания принципов использования языка Python на практике.\
        Материал от главы к главе постепенно усложняется. Некоторые важные моменты достаточно часто повторяются\
        (в разном контексте), особенно в начальных главах.',
        volume: 619,
        level: 'Понимающий',
        author: 'Алексей Васильев',
    },
    {
        cover: cover3,
        title: 'Автоматизация рутинных задач с помощью Python',
        about: 'Книга научит вас тому, как использовать Python для написания программ,\
        способных в считанные минуты сделать то, на что раньше у вас уходили часы\
        работы вручную.',
        volume: 573,
        level: 'Понимающий',
        author: 'Эл Свейгарт',
    },
];


{
    // govno code
}   
{/*export function Book(id, title, about, volume, level, author) {
    this.id = id;
    this.title = title;
    this.about = about;
    this.volume = volume;
    this.level = level;
    this.author = author;
}

export const book1 = new Book(
    1,
    'Python для детей',
    'Эта книга – самоучитель по одному из самых востребованных на сегодняшний день языков программирования – Python.\
    Начиная с самых простых действий, шаг за шагом вы будете писать свои программы и постигать тонкости этого языка.\
    Свои знания вы сможете проверить сразу же.',
    327,
    'Для новичков',
    'Джейсон Бриггс',
);

export const book2 = new Book(
    2,
    'Python в примерах & задачах',
    'В книге рассмотрены базовые методы, подходы и конструкции, важные для понимания принципов использования языка Python на практике.\
    Материал от главы к главе постепенно усложняется. Некоторые важные моменты достаточно часто повторяются\
    (в разном контексте), особенно в начальных главах.',
    619,
    'Для понимающих',
    'Алексей Васильев',
);

export const book3 = new Book(
    3,
    'Автоматизация рутинных задач с помощью Python',
    'Книга научит вас тому, как использовать Python для написания программ,\
    способных в считанные минуты сделать то, на что раньше у вас уходили часы\
    работы вручную.',
    573,
    'Для понимающих',
    'Эл Свейгарт',
);*/}